<#import "parts/common.ftl" as c>

<@c.page>

<p><h3>Гайд по сайту</h3></p>
<hr>
<div>
    На данный момент на сайте реализован следующий функционал:
    <li>на странице <a href="/main">Коктейли</a> можно посмотреть рецептов для коктейлей.
    <li>на странице <a href="/ingredients">Ингридиенты</a> можно посмотреть список всех ингредиентов доступных на сайте.
    <br>
    <li> в правом верхнем углу есть кнопка авторизации, по которой можно залогироваться на сайте. Если вы не были зарегистрированны, то на странице авторизации можно будет создать нового пользователя.
    <li> в случае создания нового пользователя, необходимо будет подтвердить свой почтовый ящик. для этого нужно зайти в свою почту и пройти по ссылке в письме (<a href="https://temp-mail.org">сервис временной почты</a> )
    <br>
    После авторизации на сайте появятся новые возможности:
    <li> рядом с кнопкой авторизации появится выпадающее меню в котором можно будет: добавить свой коктейль, добавить свой ингредиент, посмотреть какие коктейли вы можете приготовить из имеющихся у вас ингредиентов
    <li> что бы добавить ингредиент в бар, нужно зайти на страницу <a href="/ingredients">Ингридиенты</a> и нажать кнопку "Добавить в бар".

</div>

</@c.page>